2018/python-standard-type-hierarchy.org
#+TITLE:      Python 标准类型层次结构
#+AUTHOR:     rgb-24bit
#+EMAIL:      rgb-24bit@foxmail.com
#+DATE:       <2018-10-03 周三>

* 目录                                                    :TOC_4_gh:noexport:
- [[#前言][前言]]
- [[#none][None]]
- [[#notimplemented][NotImplemented]]
- [[#ellipsis][Ellipsis]]
- [[#numbersnumber][numbers.Number]]
  - [[#numbersintegral][numbers.Integral]]
  - [[#numbersrealfloat][numbers.Real(float)]]
  - [[#numberscomplexcomplex][numbers.Complex(complex)]]
  - [[#relationship][relationship]]
- [[#sequences][Sequences]]
  - [[#immutable-sequences][Immutable sequences]]
  - [[#mutable-sequences][Mutable sequences]]
- [[#set-types][Set types]]
- [[#mappings][Mappings]]
- [[#callable-types][Callable types]]
  - [[#user-defined-functions][User-defined functions]]
  - [[#instance-methods][Instance methods]]
  - [[#other][Other]]
- [[#modules][Modules]]
- [[#custom-classes][Custom classes]]
- [[#class-instances][Class instances]]
- [[#io-objects][I/O objects]]
- [[#internal-types][Internal types]]
  - [[#code-objects][Code objects]]
  - [[#frame-objects][Frame objects]]
  - [[#other-1][Other]]
- [[#结尾][结尾]]

* 前言
  这篇博客算是 [[https://docs.python.org/3/reference/datamodel.html#the-standard-type-hierarchy][The standard type hierarchy]] 的阅读笔记，配合原文阅读效果更佳。

* None
  ~NoneType~ 具有单个值。只有一个具有此值的对象。使用内置名称 ~None~ 来访问这个对象。

  *PS:* ~return None~ is better than ~return~.

* NotImplemented
  ~NotImplementedType~ 具有单个值。只有一个具有此值的对象。使用内置名称 ~NotImplemented~ 来访问这个对象。

  如果数值方法和丰富的比较方法未实现所提供操作数的操作，则应返回此值。

  *PS:* ~bool(NotImplemented)~ is ~True~.

* Ellipsis
  ~ellipsis~ 具有单个值。只有一个具有此值的对象。使用 ~...~ 或内置名称 ~Ellipsis~ 来访问这个对象。

  对于这个对象的作用，可以看一下这篇博客： [[https://farer.org/2017/11/29/python-ellipsis-object/][Python 的 Ellipsis 对象]].

  #+BEGIN_SRC python
    >>> Ellipsis is ...
    True
  #+END_SRC

  *PS:* ~...~ 的写法只有 ~Python3~ 支持.

* numbers.Number  
  ~numbers~ 是一个模块，详细内容可以浏览官方文档： [[https://docs.python.org/3/library/numbers.html][numbers — Numeric abstract base classes]].

  ~numbers.Number~ 是所有 *数值类型* 的抽象基类，也就是说，对任意一个数字进行 ~isinstance(x, numbers.Number)~ 判断
  得到的结果都为 ~True~.

  #+BEGIN_SRC python
    >>> nums = [1, 2.3, complex(1, 2)]
    >>> all(map(lambda x: isinstance(x, numbers.Number), nums))
    True
  #+END_SRC
  
** numbers.Integral
   *整数类型* 的抽象基类，其子类包括 ~Integers(int)~ 和 ~Booleans(bool)~.

   ~Booleans~ 类型只有两个值 ~True~ 和 ~False~, 同时只存在两个对于的实例对象，通过内置名称 ~True~ 和 ~False~ 来访问这两个对象。

** numbers.Real(float)
   *浮点数类型* 的抽象基类。

** numbers.Complex(complex)
   *复数类型* 的抽象基类。

   *PS:* 复数的字面值形式 ~1 + 2j~.

** relationship
   抽象基类和实际的类之间的关系：

   #+BEGIN_EXAMPLE
     numbers.Number
     +-- numbers.Complex
         +-- complex
         +-- numbers.Real
             +-- float
             +-- numbers.Rational
                 +-- numbers.Integral
                     +-- int
                         +-- bool
   #+END_EXAMPLE

* Sequences
  抽象基类 ~Sequence~ 可以在 [[https://docs.python.org/3/library/collections.abc.html][collections.abc — Abstract Base Classes for Containers]] 模块中找到。

  内置函数 ~len~ 可以获得序列的长度，通过 ~seq[i]~ 的形式获取索引位置 ~i~ 处的元素值。

  所有序列都支持 *切片* 操作： ~seq[i:j]~.

  部分序列支持 *扩展切片* 操作： ~seq[i:j:k]~.

** Immutable sequences
   不可变序列类型的对象一旦创建就不能更改，以下类型是不可变序列：

   + String :: 字符串类型 - ~str~
   + Tuples :: 元组类型 - ~tuple~
   + Bytes :: 字节字符串类型 - ~bytes~

** Mutable sequences
   可变序列在创建后可以更改，目前有两种内置的可变序列类型：

   + Lists :: 列表类型 - ~list~
   + Byte Arrays :: 字节数组类型 - ~bytearray~

* Set types
  抽象基类 ~Set~ 可以在 [[https://docs.python.org/3/library/collections.abc.html][collections.abc — Abstract Base Classes for Containers]] 模块中找到。
    
  使用内置函数 ~len~ 可以获取 ~Set~ 的成员数量。

  目前有两种固有的集合类型：
  + Sets :: 可变集合类型 - ~set~
  + Frozen sets :: 不可变集合类型 - ~frozenset()~

  *PS:* ~frozenset~ 可以用作 ~dict~ 的键，而 ~set~ 不可以。
  
* Mappings
  抽象基类 ~Mappings~ 可以在 [[https://docs.python.org/3/library/collections.abc.html][collections.abc — Abstract Base Classes for Containers]] 模块中找到。
  
  内置函数 ~len~ 可以用来获取映射中的成员数量。

  目前有一种内置映射类型：
  + Dictionaries :: 字典类型 - ~dict~

* Callable types
  抽象基类 ~Callable~ 可以在 [[https://docs.python.org/3/library/collections.abc.html][collections.abc — Abstract Base Classes for Containers]] 模块中找到。

