2018/python-standard-type-hierarchy.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-11 周一 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 标准类型层次结构</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 标准类型层次结构</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85c27e2">1. 前言</a></li>
<li><a href="#orgc9496ee">2. None</a></li>
<li><a href="#org163033a">3. NotImplemented</a></li>
<li><a href="#org05b069b">4. Ellipsis</a></li>
<li><a href="#orgbf9e141">5. numbers.Number</a>
<ul>
<li><a href="#org97229d6">5.1. numbers.Integral</a></li>
<li><a href="#orga9382a8">5.2. numbers.Real(float)</a></li>
<li><a href="#org56fce5a">5.3. numbers.Complex(complex)</a></li>
<li><a href="#org939c580">5.4. relationship</a></li>
</ul>
</li>
<li><a href="#org28c4307">6. Sequences</a>
<ul>
<li><a href="#orgeaa3825">6.1. Immutable sequences</a></li>
<li><a href="#org3e0086c">6.2. Mutable sequences</a></li>
</ul>
</li>
<li><a href="#org8e5975a">7. Set types</a></li>
<li><a href="#org6494a52">8. Mappings</a></li>
<li><a href="#orgf006140">9. Callable types</a>
<ul>
<li><a href="#org7c2cc8f">9.1. User-defined functions</a></li>
<li><a href="#orgc7674a7">9.2. Instance methods</a></li>
<li><a href="#orgb5d827c">9.3. Other</a></li>
</ul>
</li>
<li><a href="#org10ea0c7">10. Modules</a></li>
<li><a href="#orgb481d31">11. Custom classes</a></li>
<li><a href="#orgca2490a">12. Class instances</a></li>
<li><a href="#org6b06693">13. I/O objects</a></li>
<li><a href="#org2ff27ed">14. Internal types</a>
<ul>
<li><a href="#org35974e6">14.1. Code objects</a></li>
<li><a href="#orgc67a1b8">14.2. Frame objects</a></li>
<li><a href="#org174ef40">14.3. Other</a></li>
</ul>
</li>
<li><a href="#org107a7c6">15. 结尾</a></li>
</ul>
</div>
</div>

<div id="outline-container-org85c27e2" class="outline-2">
<h2 id="org85c27e2"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
这篇博客算是 <a href="https://docs.python.org/3/reference/datamodel.html#the-standard-type-hierarchy">The standard type hierarchy</a> 的阅读笔记，配合原文阅读效果更佳。
</p>
</div>
</div>

<div id="outline-container-orgc9496ee" class="outline-2">
<h2 id="orgc9496ee"><span class="section-number-2">2</span> None</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>NoneType</code> 具有单个值。只有一个具有此值的对象。使用内置名称 <code>None</code> 来访问这个对象。
</p>

<p>
<b>PS:</b> <code>return None</code> is better than <code>return</code>.
</p>
</div>
</div>

<div id="outline-container-org163033a" class="outline-2">
<h2 id="org163033a"><span class="section-number-2">3</span> NotImplemented</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>NotImplementedType</code> 具有单个值。只有一个具有此值的对象。使用内置名称 <code>NotImplemented</code> 来访问这个对象。
</p>

<p>
如果数值方法和丰富的比较方法未实现所提供操作数的操作，则应返回此值。
</p>

<p>
<b>PS:</b> <code>bool(NotImplemented)</code> is <code>True</code>.
</p>
</div>
</div>

<div id="outline-container-org05b069b" class="outline-2">
<h2 id="org05b069b"><span class="section-number-2">4</span> Ellipsis</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>ellipsis</code> 具有单个值。只有一个具有此值的对象。使用 <code>...</code> 或内置名称 <code>Ellipsis</code> 来访问这个对象。
</p>

<p>
对于这个对象的作用，可以看一下这篇博客： <a href="https://farer.org/2017/11/29/python-ellipsis-object/">Python 的 Ellipsis 对象</a>.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-constant">Ellipsis</span> <span class="org-keyword">is</span> ...
<span class="org-constant">True</span>
</pre>
</div>

<p>
<b>PS:</b> <code>...</code> 的写法只有 <code>Python3</code> 支持.
</p>
</div>
</div>

<div id="outline-container-orgbf9e141" class="outline-2">
<h2 id="orgbf9e141"><span class="section-number-2">5</span> numbers.Number</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>numbers</code> 是一个模块，详细内容可以浏览官方文档： <a href="https://docs.python.org/3/library/numbers.html">numbers — Numeric abstract base classes</a>.
</p>

<p>
<code>numbers.Number</code> 是所有 <b>数值类型</b> 的抽象基类，也就是说，对任意一个数字进行 <code>isinstance(x, numbers.Number)</code> 判断
得到的结果都为 <code>True</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-variable-name">nums</span> = [1, 2.3, <span class="org-builtin">complex</span>(1, 2)]
&gt;&gt;&gt; <span class="org-builtin">all</span>(<span class="org-builtin">map</span>(<span class="org-keyword">lambda</span> x: <span class="org-builtin">isinstance</span>(x, numbers.Number), nums))
<span class="org-constant">True</span>
</pre>
</div>
</div>

<div id="outline-container-org97229d6" class="outline-3">
<h3 id="org97229d6"><span class="section-number-3">5.1</span> numbers.Integral</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>整数类型</b> 的抽象基类，其子类包括 <code>Integers(int)</code> 和 <code>Booleans(bool)</code>.
</p>

<p>
<code>Booleans</code> 类型只有两个值 <code>True</code> 和 <code>False</code>, 同时只存在两个对于的实例对象，通过内置名称 <code>True</code> 和 <code>False</code> 来访问这两个对象。
</p>
</div>
</div>

<div id="outline-container-orga9382a8" class="outline-3">
<h3 id="orga9382a8"><span class="section-number-3">5.2</span> numbers.Real(float)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>浮点数类型</b> 的抽象基类。
</p>
</div>
</div>

<div id="outline-container-org56fce5a" class="outline-3">
<h3 id="org56fce5a"><span class="section-number-3">5.3</span> numbers.Complex(complex)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>复数类型</b> 的抽象基类。
</p>

<p>
<b>PS:</b> 复数的字面值形式 <code>1 + 2j</code>.
</p>
</div>
</div>

<div id="outline-container-org939c580" class="outline-3">
<h3 id="org939c580"><span class="section-number-3">5.4</span> relationship</h3>
<div class="outline-text-3" id="text-5-4">
<p>
抽象基类和实际的类之间的关系：
</p>

<pre class="example">
numbers.Number
+-- numbers.Complex
    +-- complex
    +-- numbers.Real
        +-- float
        +-- numbers.Rational
            +-- numbers.Integral
                +-- int
                    +-- bool
</pre>
</div>
</div>
</div>

<div id="outline-container-org28c4307" class="outline-2">
<h2 id="org28c4307"><span class="section-number-2">6</span> Sequences</h2>
<div class="outline-text-2" id="text-6">
<p>
抽象基类 <code>Sequence</code> 可以在 <a href="https://docs.python.org/3/library/collections.abc.html">collections.abc — Abstract Base Classes for Containers</a> 模块中找到。
</p>

<p>
内置函数 <code>len</code> 可以获得序列的长度，通过 <code>seq[i]</code> 的形式获取索引位置 <code>i</code> 处的元素值。
</p>

<p>
所有序列都支持 <b>切片</b> 操作： <code>seq[i:j]</code>.
</p>

<p>
部分序列支持 <b>扩展切片</b> 操作： <code>seq[i:j:k]</code>.
</p>
</div>

<div id="outline-container-orgeaa3825" class="outline-3">
<h3 id="orgeaa3825"><span class="section-number-3">6.1</span> Immutable sequences</h3>
<div class="outline-text-3" id="text-6-1">
<p>
不可变序列类型的对象一旦创建就不能更改，以下类型是不可变序列：
</p>

<dl class="org-dl">
<dt>String</dt><dd>字符串类型 - <code>str</code></dd>
<dt>Tuples</dt><dd>元组类型 - <code>tuple</code></dd>
<dt>Bytes</dt><dd>字节字符串类型 - <code>bytes</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org3e0086c" class="outline-3">
<h3 id="org3e0086c"><span class="section-number-3">6.2</span> Mutable sequences</h3>
<div class="outline-text-3" id="text-6-2">
<p>
可变序列在创建后可以更改，目前有两种内置的可变序列类型：
</p>

<dl class="org-dl">
<dt>Lists</dt><dd>列表类型 - <code>list</code></dd>
<dt>Byte Arrays</dt><dd>字节数组类型 - <code>bytearray</code></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org8e5975a" class="outline-2">
<h2 id="org8e5975a"><span class="section-number-2">7</span> Set types</h2>
<div class="outline-text-2" id="text-7">
<p>
抽象基类 <code>Set</code> 可以在 <a href="https://docs.python.org/3/library/collections.abc.html">collections.abc — Abstract Base Classes for Containers</a> 模块中找到。
</p>

<p>
使用内置函数 <code>len</code> 可以获取 <code>Set</code> 的成员数量。
</p>

<p>
目前有两种固有的集合类型：
</p>
<dl class="org-dl">
<dt>Sets</dt><dd>可变集合类型 - <code>set</code></dd>
<dt>Frozen sets</dt><dd>不可变集合类型 - <code>frozenset()</code></dd>
</dl>

<p>
<b>PS:</b> <code>frozenset</code> 可以用作 <code>dict</code> 的键，而 <code>set</code> 不可以。
</p>
</div>
</div>

<div id="outline-container-org6494a52" class="outline-2">
<h2 id="org6494a52"><span class="section-number-2">8</span> Mappings</h2>
<div class="outline-text-2" id="text-8">
<p>
抽象基类 <code>Mappings</code> 可以在 <a href="https://docs.python.org/3/library/collections.abc.html">collections.abc — Abstract Base Classes for Containers</a> 模块中找到。
</p>

<p>
内置函数 <code>len</code> 可以用来获取映射中的成员数量。
</p>

<p>
目前有一种内置映射类型：
</p>
<dl class="org-dl">
<dt>Dictionaries</dt><dd>字典类型 - <code>dict</code></dd>
</dl>
</div>
</div>

<div id="outline-container-orgf006140" class="outline-2">
<h2 id="orgf006140"><span class="section-number-2">9</span> Callable types</h2>
<div class="outline-text-2" id="text-9">
<p>
抽象基类 <code>Callable</code> 可以在 <a href="https://docs.python.org/3/library/collections.abc.html">collections.abc — Abstract Base Classes for Containers</a> 模块中找到。
</p>
</div>
