2018/python-standard-type-hierarchy.org
** User-defined functions
   用户定义的函数自然是可调用对象，同时也包含了一些特殊的属性：
   |-----------------+------------------------------------------------+-----------|
   | 属性            | 含义                                           | 读/写权限 |
   |-----------------+------------------------------------------------+-----------|
   | ~__doc__~         | 文档字符串                                     | 可读可写  |
   | ~__name__~        | 函数名称                                       | 可读可写  |
   | ~__qualname__~    | 函数的 ~qualified name~                          | 可读可写  |
   | ~__module__~      | 定义函数的模块的名称                           | 可读可写  |
   | ~__defaults__~    | 默认值参数元组                                 | 可读可写  |
   | ~__code__~        | 表示已编译的函数体                             | 可读可写  |
   | ~__globals__~     | 对包含函数全局变量的字典的引用                 | 只读      |
   | ~__dict__~        | 函数属性                                       | 可读可写  |
   | ~__closure__~     | 以包含 ~cell~ 的元组形式返回闭包所包含的自由变量 | 只读      |
   | ~__annotations__~ | 包含参数注释的字典                             | 可读可写  |
   | ~__kwdefaults__~  | 包含强制关键字参数的默认值的字典               | 可读可写  |
   |-----------------+------------------------------------------------+-----------|
   
   这些属性的使用可以参考博客： [[https://segmentfault.com/a/1190000005685090][Python 自定义函数的特殊属性（收藏专用）]]

** Instance methods
   实例方法具有用户自定义函数的大多数特殊属性，同时具有一些自己的 *只读* 特殊属性：
   |------------+---------------------------|
   | 属性       | 含义                      |
   |------------+---------------------------|
   | ~__self__~   | 实例                      |
   | ~__func__~   | 函数对象                  |
   | ~__doc__~    | same as ~__func__.__doc__~  |
   | ~__name__~   | same as ~__func__.__name__~ |
   | ~__module__~ | 定义方法的模块的名称      |
   |------------+---------------------------|

   实例方法的特殊属性可以参考博客： [[https://segmentfault.com/a/1190000005701971][Python （类）实例方法的特殊属性]]

** Other
  + Generator functions :: 使用了 ~yield~ 语句的函数为 *生成器函数*, 生成器的使用可以参考博客 [[file:python-generator.org][Python 生成器]].

  + Coroutine functions :: 使用 ~async def~ 定义的函数或方法为 ~Coroutine functions~.

  + Asynchronous generator functions  :: 使用 ~async def~ 定义的 *生成器函数* 为 ~Asynchronous generator functions~, 可以得到双倍的快乐。

  + Built-in functions :: 内置函数对象是 ~C~ 函数的包装器，源码可见： [[https://github.com/python/cpython/blob/master/Python/bltinmodule.c][bltinmodule.c]].

  + Built-in methods :: 内置函数的另一种包装，隐式传递额外的参数。

  + Classes :: 类对象是可调用的，创建实例的过程就是调用类对象的过程。

  + Class Instances :: 在类对象中定义 ~__call__~ 方法使得实例对象可调用。

* Modules
  模块对象由 [[https://docs.python.org/3/reference/import.html#importsystem][import system]] 创建，对模块对象的属性引用被转换为该字典中的查找。

  也就是说： ~m.x~ 等价于 ~m.__dict__["x"]~.

  模块对象的一些可读可写的属性：
  |-----------------+--------------------------------------|
  | 属性            | 含义                                 |
  |-----------------+--------------------------------------|
  | ~__name__~        | 模块名                               |
  | ~__doc__~         | 模块文档字符串                       |
  | ~__annotations__~ | 模块正文执行期间收集的变量注释的字典 |
  | ~__file__~        | 模块文件路径                         |
  |-----------------+--------------------------------------|

  特殊的只读属性： ~__dict__~ 模块名称空间的字典对象。

* Custom classes
  自定义类也有一些特殊属性：
  |-----------------+----------------|
  | 属性            | 含义           |
  |-----------------+----------------|
  | ~__name__~        | 类名           |
  | ~__module__~      | 定义类的模块名 |
  | ~__dict__~        | 类名称空间字典 |
  | ~__bases__~       | 基类元组       |
  | ~__doc__~         | 类文档字符串   |
  | ~__annotations__~ | 类变量注释字典 |
  |-----------------+----------------|

* Class instances
  实例对象的属性基本上都是由我们自己管理的了，至少我不希望自己创建的实例多出了什么奇怪的属性。

  和实例相关的一个有用的东西： [[file:python-special-method.org][Python 魔法方法]].

* I/O objects
  也称为 *文件对象*, 前段时间了解了一下 ~Python I/O~ 的封装层次，然后发现， ~Java~ 中也差不多。

  基本的字节流，加上缓冲区的字节流，加上编码的带缓冲区的字节流。

* Internal types
  向用户公开的一些解释器内部使用的一些类型。

** Code objects
   ~Code~ 对象属于 *不可变* 对象，同时不包含任何可变对象的引用。

   一些特殊的只读属性：
   |----------------+------------------------------------------|
   | 属性           | 含义                                     |
   |----------------+------------------------------------------|
   | ~co_name~        | 函数名称                                 |
   | ~co_argcount~    | 位置参数的数量，包含具有默认值的参数     |
   | ~co_nlocals~     | 函数使用的局部变量数，包括参数           |
   | ~co_varnames~    | 局部变量名称的元组                       |
   | ~co_cellvars~    | 嵌套函数引用的局部变量名称的元组         |
   | ~co_freevars~    | 自由变量名称的元组                       |
   | ~co_code~        | 表示字节码指令序列的字符串               |
   | ~co_consts~      | 包含字节码使用的文字的元组               |
   | ~co_names~       | 包含字节码使用的名称的元组               |
   | ~co_filename~    | 编译代码的文件名                         |
   | ~co_firstlineno~ | 函数的第一个行号                         |
   | ~co_lnotab~      | 用于编码从字节码偏移到行号的映射的字符串 |
   | ~co_stacksize~   | 必需的堆栈大小                           |
   | ~co_flags~       | 用于编码解释器的整数标志                 |
   |----------------+------------------------------------------|
  
