2018/python-standard-type-hierarchy.html

<div id="outline-container-org7c2cc8f" class="outline-3">
<h3 id="org7c2cc8f"><span class="section-number-3">9.1</span> User-defined functions</h3>
<div class="outline-text-3" id="text-9-1">
<p>
用户定义的函数自然是可调用对象，同时也包含了一些特殊的属性：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">读/写权限</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>__doc__</code></td>
<td class="org-left">文档字符串</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__name__</code></td>
<td class="org-left">函数名称</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__qualname__</code></td>
<td class="org-left">函数的 <code>qualified name</code></td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__module__</code></td>
<td class="org-left">定义函数的模块的名称</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__defaults__</code></td>
<td class="org-left">默认值参数元组</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__code__</code></td>
<td class="org-left">表示已编译的函数体</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__globals__</code></td>
<td class="org-left">对包含函数全局变量的字典的引用</td>
<td class="org-left">只读</td>
</tr>

<tr>
<td class="org-left"><code>__dict__</code></td>
<td class="org-left">函数属性</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__closure__</code></td>
<td class="org-left">以包含 <code>cell</code> 的元组形式返回闭包所包含的自由变量</td>
<td class="org-left">只读</td>
</tr>

<tr>
<td class="org-left"><code>__annotations__</code></td>
<td class="org-left">包含参数注释的字典</td>
<td class="org-left">可读可写</td>
</tr>

<tr>
<td class="org-left"><code>__kwdefaults__</code></td>
<td class="org-left">包含强制关键字参数的默认值的字典</td>
<td class="org-left">可读可写</td>
</tr>
</tbody>
</table>

<p>
这些属性的使用可以参考博客： <a href="https://segmentfault.com/a/1190000005685090">Python 自定义函数的特殊属性（收藏专用）</a>
</p>
</div>
</div>

<div id="outline-container-orgc7674a7" class="outline-3">
<h3 id="orgc7674a7"><span class="section-number-3">9.2</span> Instance methods</h3>
<div class="outline-text-3" id="text-9-2">
<p>
实例方法具有用户自定义函数的大多数特殊属性，同时具有一些自己的 <b>只读</b> 特殊属性：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>__self__</code></td>
<td class="org-left">实例</td>
</tr>

<tr>
<td class="org-left"><code>__func__</code></td>
<td class="org-left">函数对象</td>
</tr>

<tr>
<td class="org-left"><code>__doc__</code></td>
<td class="org-left">same as <code>__func__.__doc__</code></td>
</tr>

<tr>
<td class="org-left"><code>__name__</code></td>
<td class="org-left">same as <code>__func__.__name__</code></td>
</tr>

<tr>
<td class="org-left"><code>__module__</code></td>
<td class="org-left">定义方法的模块的名称</td>
</tr>
</tbody>
</table>

<p>
实例方法的特殊属性可以参考博客： <a href="https://segmentfault.com/a/1190000005701971">Python （类）实例方法的特殊属性</a>
</p>
</div>
</div>

<div id="outline-container-orgb5d827c" class="outline-3">
<h3 id="orgb5d827c"><span class="section-number-3">9.3</span> Other</h3>
<div class="outline-text-3" id="text-9-3">
<dl class="org-dl">
<dt>Generator functions</dt><dd>使用了 <code>yield</code> 语句的函数为 <b>生成器函数</b>, 生成器的使用可以参考博客 <a href="python-generator.html">Python 生成器</a>.</dd>

<dt>Coroutine functions</dt><dd>使用 <code>async def</code> 定义的函数或方法为 <code>Coroutine functions</code>.</dd>

<dt>Asynchronous generator functions </dt><dd>使用 <code>async def</code> 定义的 <b>生成器函数</b> 为 <code>Asynchronous generator functions</code>, 可以得到双倍的快乐。</dd>

<dt>Built-in functions</dt><dd>内置函数对象是 <code>C</code> 函数的包装器，源码可见： <a href="https://github.com/python/cpython/blob/master/Python/bltinmodule.c">bltinmodule.c</a>.</dd>

<dt>Built-in methods</dt><dd>内置函数的另一种包装，隐式传递额外的参数。</dd>

<dt>Classes</dt><dd>类对象是可调用的，创建实例的过程就是调用类对象的过程。</dd>

<dt>Class Instances</dt><dd>在类对象中定义 <code>__call__</code> 方法使得实例对象可调用。</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org10ea0c7" class="outline-2">
<h2 id="org10ea0c7"><span class="section-number-2">10</span> Modules</h2>
<div class="outline-text-2" id="text-10">
<p>
模块对象由 <a href="https://docs.python.org/3/reference/import.html#importsystem">import system</a> 创建，对模块对象的属性引用被转换为该字典中的查找。
</p>

<p>
也就是说： <code>m.x</code> 等价于 <code>m.__dict__["x"]</code>.
</p>

<p>
模块对象的一些可读可写的属性：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>__name__</code></td>
<td class="org-left">模块名</td>
</tr>

<tr>
<td class="org-left"><code>__doc__</code></td>
<td class="org-left">模块文档字符串</td>
</tr>

<tr>
<td class="org-left"><code>__annotations__</code></td>
<td class="org-left">模块正文执行期间收集的变量注释的字典</td>
</tr>

<tr>
<td class="org-left"><code>__file__</code></td>
<td class="org-left">模块文件路径</td>
</tr>
</tbody>
</table>

<p>
特殊的只读属性： <code>__dict__</code> 模块名称空间的字典对象。
</p>
</div>
</div>

<div id="outline-container-orgb481d31" class="outline-2">
<h2 id="orgb481d31"><span class="section-number-2">11</span> Custom classes</h2>
<div class="outline-text-2" id="text-11">
<p>
自定义类也有一些特殊属性：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>__name__</code></td>
<td class="org-left">类名</td>
</tr>

<tr>
<td class="org-left"><code>__module__</code></td>
<td class="org-left">定义类的模块名</td>
</tr>

<tr>
<td class="org-left"><code>__dict__</code></td>
<td class="org-left">类名称空间字典</td>
</tr>

<tr>
<td class="org-left"><code>__bases__</code></td>
<td class="org-left">基类元组</td>
</tr>

<tr>
<td class="org-left"><code>__doc__</code></td>
<td class="org-left">类文档字符串</td>
</tr>

<tr>
<td class="org-left"><code>__annotations__</code></td>
<td class="org-left">类变量注释字典</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgca2490a" class="outline-2">
<h2 id="orgca2490a"><span class="section-number-2">12</span> Class instances</h2>
<div class="outline-text-2" id="text-12">
<p>
实例对象的属性基本上都是由我们自己管理的了，至少我不希望自己创建的实例多出了什么奇怪的属性。
</p>

<p>
和实例相关的一个有用的东西： <a href="python-special-method.html">Python 魔法方法</a>.
</p>
</div>
</div>

<div id="outline-container-org6b06693" class="outline-2">
<h2 id="org6b06693"><span class="section-number-2">13</span> I/O objects</h2>
<div class="outline-text-2" id="text-13">
<p>
也称为 <b>文件对象</b>, 前段时间了解了一下 <code>Python I/O</code> 的封装层次，然后发现， <code>Java</code> 中也差不多。
</p>

<p>
基本的字节流，加上缓冲区的字节流，加上编码的带缓冲区的字节流。
</p>
</div>
</div>

<div id="outline-container-org2ff27ed" class="outline-2">
<h2 id="org2ff27ed"><span class="section-number-2">14</span> Internal types</h2>
<div class="outline-text-2" id="text-14">
<p>
向用户公开的一些解释器内部使用的一些类型。
</p>
</div>

<div id="outline-container-org35974e6" class="outline-3">
<h3 id="org35974e6"><span class="section-number-3">14.1</span> Code objects</h3>
<div class="outline-text-3" id="text-14-1">
<p>
<code>Code</code> 对象属于 <b>不可变</b> 对象，同时不包含任何可变对象的引用。
</p>

<p>
一些特殊的只读属性：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>co_name</code></td>
<td class="org-left">函数名称</td>
</tr>

<tr>
<td class="org-left"><code>co_argcount</code></td>
<td class="org-left">位置参数的数量，包含具有默认值的参数</td>
</tr>

<tr>
<td class="org-left"><code>co_nlocals</code></td>
<td class="org-left">函数使用的局部变量数，包括参数</td>
</tr>

<tr>
<td class="org-left"><code>co_varnames</code></td>
<td class="org-left">局部变量名称的元组</td>
</tr>

<tr>
<td class="org-left"><code>co_cellvars</code></td>
<td class="org-left">嵌套函数引用的局部变量名称的元组</td>
</tr>

<tr>
<td class="org-left"><code>co_freevars</code></td>
<td class="org-left">自由变量名称的元组</td>
</tr>

<tr>
<td class="org-left"><code>co_code</code></td>
<td class="org-left">表示字节码指令序列的字符串</td>
</tr>

<tr>
<td class="org-left"><code>co_consts</code></td>
<td class="org-left">包含字节码使用的文字的元组</td>
</tr>

<tr>
<td class="org-left"><code>co_names</code></td>
<td class="org-left">包含字节码使用的名称的元组</td>
</tr>

<tr>
<td class="org-left"><code>co_filename</code></td>
<td class="org-left">编译代码的文件名</td>
</tr>

<tr>
<td class="org-left"><code>co_firstlineno</code></td>
<td class="org-left">函数的第一个行号</td>
</tr>

<tr>
<td class="org-left"><code>co_lnotab</code></td>
<td class="org-left">用于编码从字节码偏移到行号的映射的字符串</td>
</tr>

<tr>
<td class="org-left"><code>co_stacksize</code></td>
<td class="org-left">必需的堆栈大小</td>
</tr>

<tr>
<td class="org-left"><code>co_flags</code></td>
<td class="org-left">用于编码解释器的整数标志</td>
</tr>
</tbody>
</table>
</div>
</div>
